{
  "p5": {
    "alpha": {
      "description": "Extrae el valor de alpha de un color o de un arreglo de pixeles.",
      "params": ["Objeto: objeto p5.Color o arreglo de pixeles"],
      "returns": "the p5 object"
    },
    "blue": {
      "description": "Extrae el valor de azul de un color o de un arreglo de pixeles.",
      "params": ["Objeto: objeto p5.Color o arreglo de pixeles"],
      "returns": "the p5 object"
    },
    "brightness": {
      "description": "Extrae el valor de brillo HSB de un color o de un arreglo de pixeles.",
      "params": ["Objeto: objeto p5.Color o arreglo de pixeles"],
      "returns": "the p5 object"
    },
    "background": {
      "description": "La función background() define el color usado como fondo del lienzo p5.js. El fondo por defecto es gris claro. Esta función es típicamente usada dentro de draw() para despejar o borrar la ventana mostrada al inicio de cada cuadro, pero puede ser usada dentro de setup() para definir el fondo en el primer cuadro de la animación o si el fondo solo necesita ser definido una vez.",
      "params": ["Color: cualquier valor creado con la función color()",
               "[a]: Número: opacidad del fondo relativo al rango de color actual (por defecto es 0-100)",
               "colostring: string de color, formatos posibles: enteros rgb() o rgba(), porcentajes rgb() o rgba(), hex 3 dígitos, hex 6 dígitos",
               "gray: especifica un valor entre blanco y negro",
               "v1: valor de rojo o hue (dependiendo del modo de color actual)",
               "v2: valor de verde o saturación (dependiendo del modo de color actual)",
               "v3: alor de azul o brillo (dependiendo del modo de color actual)",
               "image: imagen creada con loadImage() o createImage(), para ser definida como fondo (debe ser del mismo tamaño que la ventana del bosquejo)"],
      "returns": "the p5 object"
    }
  },
  "p5.Image": {
    "loadPixels": {
      "description": "blah",
      "params": ["Numbero: blah",
                 "Numbero: blah"],
      "returns": "blah"
    }
  }
}
