{
  "p5": {
    "alpha": {
      "description": "description alpha",
      "params": ["Numero: param 1 alpha",
               "Numero: param 2 alpha",
               "Numero: param 3 alpha",
               "Numero: param 4 alpha",
               "Numero: param 5 alpha"],
      "returns": "the p5 object"
    },
    "background": {
      "description": "La función background() define el color usado como fondo del lienzo p5.js. El fondo por defecto es gris claro. Esta función es típicamente usada dentro de draw() para despejar o borrar la ventana mostrada al inicio de cada cuadro, pero puede ser usada dentro de setup() para definir el fondo en el primer cuadro de la animación o si el fondo solo necesita ser definido una vez.",
      "params": ["Color: cualquier valor creado con la función color()",
               "[a]: Número: opacidad del fondo relativo al rango de color actual (por defecto es 0-100)",
               "colostring: string de color, formatos posibles: enteros rgb() o rgba(), porcentajes rgb() o rgba(), hex 3 dígitos, hex 6 dígitos",
               "gray: especifica un valor entre blanco y negro",
               "v1: valor de rojo o hue (dependiendo del modo de color actual)",
               "v2: valor de verde o saturación (dependiendo del modo de color actual)",
               "v3: alor de azul o brillo (dependiendo del modo de color actual)",
               "image: imagen creada con loadImage() o createImage(), para ser definida como fondo (debe ser del mismo tamaño que la ventana del bosquejo)"],
      "returns": "the p5 object"
    },
    "print": {
      "description": "La función print() escribe en la consola del navegador. Esta función es a menudo de ayuda para observar los datos que un programa está produciendo. Esta función crea una nueva línea de texto por cada ejecución de la función. Elementos individuales pueden ser separados por comillas ('') y unidos con el operador de adición (+). Aunque print() es similar a console.log(), no llama a console.log() directamente, para simular una manera más simple de entender el comportamiento del programa. Por esto mismo, es más lento. Para resultados más rápidos, usar directamente console.log().",
      "params": ["Cualquiera: cualquier combinación de número, string, objeto, boolean o arreglo a imprimir"],
      "returns": "el objeto p5"
    },
    "frameCount": {
      "description": "La variable de sistema frameCount contiene el número de cuadros (frames) que se han mostrado desde que el programa empezó a ejecutarse. Dentro de setup() el valor es 0, después de la primera iteración de draw() es 1, etc.",
      "returns": "el objeto p5"
    },
    "focused": {
      "description": "Confirma si la ventana de un programa de p5.js está en foco, lo que significa que el bosquejo aceptará entradas desde el ratón o teclado. Esta variable es verdadera (true) si la ventana está en foco y falsa (false) si no.",
      "returns": "el objeto p5"
    }
  },
  "p5.Image": {
    "loadPixels": {
      "description": "blah",
      "params": ["Numbero: blah",
                 "Numbero: blah"],
      "returns": "blah"
    }
  }
}
