/*
  * @name आर्म
  * @description यह उदाहरण बनाने के लिए ट्रांसफ़ॉर्म मैट्रिसेस का उपयोग करता है
  * एक हाथ। प्रत्येक खंड के कोण को द्वारा नियंत्रित किया जाता है
  * माउसएक्स और माउसवाई स्थिति। पर लागू किए गए परिवर्तन
  * पहला खंड दूसरे खंड पर भी लागू होता है
  * क्योंकि वे एक ही push() और . के अंदर हैं
  * pop() मैट्रिक्स समूह।
  */

let x, y;
let angle1 = 0.0;
let angle2 = 0.0;
let segLength = 100;

function setup() {
  createCanvas(720, 400);
  strokeWeight(30);

  // अर्ध-पारदर्शी सफेद के साथ स्ट्रोक
  stroke(255, 160);

  // हाथ के "कंधे" को कैनवास के केंद्र में रखें
  x = width * 0.5;
  y = height * 0.5;
}

function draw() {
  background(0);

  // माउस की स्थिति के अनुसार खंडों के कोण को बदलें
  angle1 = (mouseX / float(width) - 0.5) * -TWO_PI;
  angle2 = (mouseY / float(height) - 0.5) * PI;

   // ट्रांसफ़ॉर्म को "शामिल" करने के लिए पुश और पॉप का उपयोग करें। ध्यान दें कि
   // भले ही हम एक कस्टम फ़ंक्शन का उपयोग करके सेगमेंट बनाते हैं,
   // परिवर्तन अभी भी जमा होते हैं
  push();
  segment(x, y, angle1);
  segment(segLength, 0, angle2);
  pop();
}

// सेगमेंट ड्राइंग के लिए एक कस्टम फ़ंक्शन
function segment(x, y, a) {
  translate(x, y);
  rotate(a);
  line(0, 0, segLength, 0);
}
