/*
  * @name बेज़ियर
  * @description bezier() फ़ंक्शन के लिए पहले दो पैरामीटर निर्दिष्ट करते हैं
  * वक्र में पहला बिंदु और अंतिम दो पैरामीटर अंतिम बिंदु निर्दिष्ट करते हैं।
  * मध्य पैरामीटर नियंत्रण बिंदु निर्धारित करते हैं जो आकार को परिभाषित करते हैं
  * वक्र।
  */
function setup() {
  createCanvas(720, 400);
  stroke(255);
  noFill();
}

function draw() {
  background(0);
  for (let i = 0; i < 200; i += 20) {
    bezier(
      mouseX - i / 2.0,
      40 + i,
      410,
      20,
      440,
      300,
      240 - i / 16.0,
      300 + i / 8.0
    );
  }
}
