/*
  * @name सशर्त 1
  * @description शर्तें सवालों की तरह हैं।
  * वे एक कार्यक्रम को एक कार्रवाई करने का निर्णय लेने की अनुमति देते हैं यदि
  * किसी प्रश्न का उत्तर सत्य है या कोई अन्य क्रिया करना
  * यदि प्रश्न का उत्तर गलत है।
  * एक कार्यक्रम के भीतर पूछे जाने वाले प्रश्न हमेशा तार्किक होते हैं
  * या संबंधपरक बयान। उदाहरण के लिए, यदि चर 'i' is
  * शून्य के बराबर फिर एक रेखा खींचे।
  */
function setup() {
  createCanvas(720, 360);
  background(0);

  for (let i = 10; i < width; i += 10) {
   // यदि 'i' को 20 से विभाजित किया जाता है और कोई शेष नहीं है तो पहली पंक्ति बनाएं
   // अन्यथा दूसरी पंक्ति बनाएं
    if (i % 20 === 0) {
      stroke(255);
      line(i, 80, i, height / 2);
    } else {
      stroke(153);
      line(i, 20, i, 180);
    }
  }
}
