/*
  * @name पैरामीट्रिक समीकरण
  * @description एक पैरामीट्रिक समीकरण है जहाँ x और y
  * निर्देशांक दोनों एक दूसरे अक्षर के रूप में लिखे गए हैं। यह है
  * एक पैरामीटर कहा जाता है और आमतौर पर अक्षर t या में दिया जाता है।
  * इसकी प्रेरणा एलेक्जेंडर मिलर के यूट्यूब चैनल से ली गई है।
  */

function setup(){
  createCanvas(720,400);
}

// वह पैरामीटर जिस पर x और y निर्भर करते हैं, आमतौर पर या तो t या थीटा के प्रतीक के रूप में लिया जाता है
let t = 0;
function draw(){
  background('#fff');
  translate(width/2,height/2);
  stroke('#0f0f0f');
  strokeWeight(1.5);
  //loop for adding 100 lines
  for(let i = 0;i<100;i++){
    line(x1(t+i),y1(t+i),x2(t+i)+20,y2(t+i)+20);
  }
  t+=0.15;
}
// लाइन के प्रारंभिक x समन्वय को बदलने के लिए कार्य
function x1(t){
  return sin(t/10)*125+sin(t/20)*125+sin(t/30)*125;
}

// लाइन के प्रारंभिक y समन्वय को बदलने के लिए कार्य change
function y1(t){
  return cos(t/10)*125+cos(t/20)*125+cos(t/30)*125;
}

// लाइन के अंतिम x समन्वय को बदलने के लिए कार्य
function x2(t){
  return sin(t/15)*125+sin(t/25)*125+sin(t/35)*125;
}

// लाइन के अंतिम y समन्वय को बदलने के लिए कार्य
function y2(t){
  return cos(t/15)*125+cos(t/25)*125+cos(t/35)*125;
}