/*
  * @name रिकर्सिव ट्री
  * @description रिकर्सन के माध्यम से एक साधारण पेड़ जैसी संरचना प्रदान करता है।
  * ब्रांचिंग एंगल की गणना हॉरिजॉन्टल माउस के फंक्शन के रूप में की जाती है
  * स्थान। कोण बदलने के लिए माउस को बाएँ और दाएँ घुमाएँ।
  * प्रोसेसिंग के लिए डेनियल शिफमैन के <a href="https://processing.org/examples/tree.html">रिकर्सिव ट्री उदाहरण</a> पर आधारित।
  */
let theta;

function setup() {
  createCanvas(710, 400);
}

function draw() {
  background(0);
  frameRate(30);
  stroke(255);
  // आइए माउस की स्थिति के आधार पर 0 से 90 डिग्री का कोण चुनें
  let a = (mouseX / width) * 90;
  // इसे रेडियन में बदलें
  theta = radians(a);
  // स्क्रीन के नीचे से पेड़ शुरू करें
  translate(width/2,height);
  // 120 पिक्सल की एक लाइन बनाएं
  line(0,0,0,-120);
  // उस लाइन के अंत में जाएँ
  translate(0,-120);
  // रिकर्सिव ब्रांचिंग शुरू करें!
  branch(120);

}

function branch(h) {
  // प्रत्येक शाखा पिछले एक के आकार का 2/3 होगा
  h *= 0.66;

 // सभी पुनरावर्ती कार्यों में बाहर निकलने की स्थिति होनी चाहिए !!!!
   // यहाँ, हमारा है जब शाखा की लंबाई 2 पिक्सेल या उससे कम है
  if (h > 2) {
    push();   // परिवर्तन की वर्तमान स्थिति को बचाएं (अर्थात अब हम कहां हैं)
    rotate(theta);  // थीटा द्वारा घुमाएं
    line(0, 0, 0, -h);  // शाखा ड्रा करें
    translate(0, -h); // शाखा के अंत में ले जाएँ
    branch(h);      // ठीक है, अब दो नई शाखाएँ बनाने के लिए खुद को बुलाएँ !!
    pop();     // जब भी हम यहां वापस आते हैं, तो हम पिछली मैट्रिक्स स्थिति को पुनर्स्थापित करने के लिए "पॉप" करते हैं

    // एक ही बात दोहराएं, इस बार केवल "बाईं ओर" शाखा बंद करें!
    push();
    rotate(-theta);
    line(0, 0, 0, -h);
    translate(0, -h);
    branch(h);
    pop();
  }
}
