/*
  * @name शेप प्रिमिटिव्स
  * @description मूल आकार के आदिम कार्य triangle() हैं,
  * rect(), quad(), ellipse(), और arc()। वर्ग रेक्ट के साथ बने होते हैं ()
  * और ellipse() से बनाए जाते हैं। इन कार्यों में से प्रत्येक की आवश्यकता है
  * आकार की स्थिति और आकार निर्धारित करने के लिए कई पैरामीटर।
  */
function setup() {
  // स्क्रीन को 720 पिक्सल चौड़ा और 400 पिक्सल ऊंचा सेट करता है
  createCanvas(720, 400);
  background(0);
  noStroke();

  fill(204);
  triangle(18, 18, 18, 360, 81, 360);

  fill(102);
  rect(81, 81, 63, 63);

  fill(204);
  quad(189, 18, 216, 18, 216, 360, 144, 360);

  fill(255);
  ellipse(252, 144, 72, 72);

  fill(204);
  triangle(288, 18, 351, 360, 288, 360);

  fill(255);
  arc(479, 300, 280, 280, PI, TWO_PI);
}
