/*
  * @name परिवर्तनीय दायरा
  * @description वेरिएबल्स का एक ग्लोबल या फंक्शन "स्कोप" होता है। उदाहरण के लिए,
  * या तो setup() या draw() फ़ंक्शन के भीतर घोषित चर हो सकते हैं
  * केवल इन कार्यों में उपयोग किया जाता है। वैश्विक चर, बाहर घोषित चर
  * setup() और draw(), कार्यक्रम के भीतर कहीं भी इस्तेमाल किया जा सकता है। यदि एक समारोह
  * वैरिएबल को ग्लोबल वैरिएबल के समान नाम से घोषित किया जाता है, प्रोग्राम
  * वर्तमान के भीतर अपनी गणना करने के लिए फ़ंक्शन चर का उपयोग करेगा
  * गुंजाइश।
  */
let a = 80; // एक वैश्विक चर "ए" बनाएं

function setup() {
  createCanvas(720, 400);
  background(0);
  stroke(255);
  noLoop();
}

function draw() {
  // वैश्विक चर "ए" का उपयोग करके एक रेखा खींचें
  line(a, 0, a, height);

  // लूप के लिए स्थानीय चर a का उपयोग करें
  for (let a = 120; a < 200; a += 3) {
    line(a, 0, a, height);
  }

  // कस्टम फ़ंक्शन को कॉल करें drawAnotherLine ()
  drawAnotherLine();

  // कस्टम फ़ंक्शन पर कॉल करें drawYetAnotherLine ()
  drawYetAnotherLine();
}

function drawAnotherLine() {
  // इस फ़ंक्शन के लिए एक नया चर "ए" स्थानीय बनाएं
  let a = 320;
  // स्थानीय चर "ए" का उपयोग करके एक रेखा खींचें
  line(a, 0, a, height);
}

function drawYetAnotherLine() {
   // क्योंकि कोई नया स्थानीय चर "ए" सेट नहीं है,
   // यह रेखा मूल वैश्विक का उपयोग करके खींची गई है
   // चर "ए" जो मान 20 पर सेट है। 
  line(a + 3, 0, a + 3, height);
}
