/*
  * @name सरल आकार
  * @description इस उदाहरण में एक वृत्त, वर्ग, त्रिभुज और एक फूल शामिल है।
  */
function setup() {
  // कैनवास बनाएं
  createCanvas(720, 400);
  background(200);
  
  // रंग सेट करें
  fill(204, 101, 192, 127);
  stroke(127, 63, 120);

  // एक चतुर्भुज
  rect(40, 120, 120, 40);
  // एक दीर्घवृत्त
  ellipse(240, 240, 80, 80);
  // एक त्रिभुज
  triangle(300, 100, 320, 100, 310, 80);

  // एक साधारण फूल के लिए एक डिजाइन
  translate(580, 200);
  noStroke();
  for (let i = 0; i < 10; i ++) {
    ellipse(0, 30, 20, 80);
    rotate(PI/5);
  }
}
